* Расчёты для четвертой главы курсового

** 4.1
*** Суммарная площадь занимаемая всеми ИЭТ
**** Площадь круглых ИЭТ
В третьем столбце диаметр компонента, в четвертом площадь, в втором
количество.
#+constants: pi=3.1415926
| R1...R4  | 4 | 2.5 |    19.635 |        мм |
| R9...R10 | 2 | 2.5 |    9.8175 |           |
| R11, R12 | 2 | 1.6 |  4.021248 |           |
| R13      | 1 | 1.6 |  2.010624 |           |
| R14      | 1 | 1.6 |  2.010624 |           |
| R15      | 1 | 2.5 |   4.90875 |           |
| C1       | 1 |  13 |  132.7326 |           |
| C2       | 1 |  13 |  132.7326 |           |
| C3       | 1 |  10 |     78.54 |           |
| C4, C5   | 2 | 6.3 | 62.345052 |           |
| HA1      | 1 |  12 |  113.0976 |           |
| HL1      | 1 |   3 |    7.0686 |           |
| Sum      |   |     |           | 568.92020 |
#+TBLFM: $4=(($3/2)^2)* 3.1416 * $2::@13$5=vsum(@1$4..@-1$4)
**** Площадь прямоугольных ИЭТ
| Десигнатор   | Количество | Длина | Ширина |   #ERROR | Суммарная |
| R5...R8      |          4 |   9.5 |   7.45 |    283.1 |           |
| DA1  (TO220) |          1 | 10.16 |   4.45 |   45.212 |           |
| DD1 (ATmega) |          1 | 39.75 |  14.73 | 585.5175 |           |
| SA1, SA2     |          2 |  16.3 |   14.9 |   485.74 |           |
| VD1 (DO-41)  |          1 | 54.86 |   2.72 | 149.2192 |           |
| VD2 (DO-35)  |          1 | 54.40 |      2 |    108.8 |           |
| VD3 (TO-92)  |          1 |  3.70 |   4.70 |    17.39 |           |
| X1, X5       |          2 |  16.3 |   14.9 |   485.74 |           |
| X3           |          1 |   6.6 |    4.6 |    30.36 |           |
| X4           |          1 |   6.1 |   4.05 |   24.705 |           |
| ZQ1          |          1 |  11.9 |    5.6 |    66.64 |           |
| Sum          |            |       |        |          | 2282.4237 |

#+TBLFM: $5=($3 * $4) * $2::$6=vsum(@2$5..@-1$5)::@15$5=vsum(@2$$5..@-1$5)
**** Сумма площадей ИЭТ
#+begin_src elisp
	 (+  568.9  2282.4)
#+end_src

#+RESULTS:
: 2851.3
